#+TITILE: MPI
#+AUTHOR: Abhishek Raj
#+DATE: 2025-11-08

[[github.com/CISSSCO/workshop.git][github.com/CISSSCO/workshop.git]]

** run
#+begin_src bash :session openmpi :results output :exports both
./hello.out
#+end_src

#+RESULTS:
: Hello, World

** run
#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./hello1.out 30
#mpirun -np 10 ./hello1.out
#+end_src

#+RESULTS:
: Submitted batch job 1166188

* task1
#+begin_src C :tangle task1.c
#include<stdio.h>
#include<mpi.h>
#define N 1000
int main(){
    int size, rank;
    int a[N];
    MPI_Init(NULL, NULL);
    MPI_Comm_size(MPI_COMM_WORLD, &size);
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    int chunksize = N / size;
    int start = rank * chunksize;
    int end = start + chunksize;
    if(rank == size - 1) end = N;
    for(int i = start; i < end; i++){
        a[i] = i + 1;
    }

    for(int i = start; i < end; i++){
        printf("%d ", a[i]);
    }
    printf("\n");
    MPI_Finalize();
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc task1.c -o task1.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./task1.out 4 
#+end_src

#+RESULTS:
: Submitted batch job 1165560

* Point-to-point communication
#+begin_src C :tangle p2p_mpi.c
#include"stdio.h"
#include"mpi.h"

int main(int argc, char **argv)
{
	int myid, size;
	int myval;

	//MPI_Init(&argc,&argv);
    MPI_Init(NULL,NULL);

	MPI_Comm_size(MPI_COMM_WORLD, &size);

	MPI_Comm_rank(MPI_COMM_WORLD, &myid);

	if(myid==0){
        myval = 100;
		printf("\nmyid: %d \t myval = %d", myid, myval);
		MPI_Send(&myval, 1, MPI_INT, 1, 0, MPI_COMM_WORLD);
		printf("\nmyid: %d \t Data sent.\n", myid);
	}
	else if(myid==1){	// Process with ID exactly equal to 1
        myval = 200;
		MPI_Recv(&myval, 1, MPI_INT, 0, 0, MPI_COMM_WORLD, MPI_STATUS_IGNORE);
		printf("\nmyid: %d \t Data received.", myid);
		printf("\nmyid: %d \t myval = %d", myid, myval);
		printf("\n\nProgram exit!\n");
	}

	//End MPI environment
	MPI_Finalize();
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc p2p_mpi.c -o p2p_mpi.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./p2p_mpi.out 2
#+end_src

#+RESULTS:
: Submitted batch job 1166246


** Sending array to process 1
#+begin_src C :tangle p2p_mpi_array7.c
#include"stdio.h"
#include"mpi.h"
#define N 100

int main()
{
	int myid, size;
	int myval;

    int arr[N];
	//Initialize MPI environment
	MPI_Init(NULL,NULL);

	//Get total number of processes
	MPI_Comm_size(MPI_COMM_WORLD, &size);

	//Get my unique ID among all processes
	MPI_Comm_rank(MPI_COMM_WORLD, &myid);

	// Process with ID exactly equal to 0
	if(myid==0){
		//Initialize data to be sent
        for(int i = 0; i < N; i++) arr[i] = i + 1;
		//Send data
		MPI_Send(arr, N, MPI_INT, 1, 0, MPI_COMM_WORLD);
		printf("\nmyid: %d \t Data sent.\n", myid);
	}
	else if(myid==1){	// Process with ID exactly equal to 1
		//Initializ receive array to some other data
		MPI_Recv(arr, N, MPI_INT, 0, 0, MPI_COMM_WORLD, MPI_STATUS_IGNORE);
		printf("\nmyid: %d \t Data received.\n", myid);
		//Print received data
        for(int i = 0; i < N; i++)
          printf("%d ", arr[i]);
	}

	//End MPI environment
	MPI_Finalize();
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc p2p_mpi_array7.c -o p2p_mpi_array7.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./p2p_mpi_array7.out 2
#+end_src

#+RESULTS:
: Submitted batch job 1165590

* Point-to-point communication
#+begin_src C :tangle p2p_mpi7.c
#include"stdio.h"
#include"mpi.h"

int main()
{
	int myid, size;
	int myval;
	MPI_Init(NULL,NULL);

	MPI_Comm_size(MPI_COMM_WORLD, &size);

	MPI_Comm_rank(MPI_COMM_WORLD, &myid);

	if(myid==0){
        myval = 100;
		printf("\nmyid: %d \t myval = %d", myid, myval);
        for(int i = 1; i < size; i++){
            MPI_Send(&myval, 1, MPI_INT, i, 0, MPI_COMM_WORLD);
        }
		printf("\nmyid: %d \t Data sent.\n", myid);
	}
	else{	// Process with ID exactly equal to 1
        if(myid == size - 1){
            printf("I left : id : %d\n", myid);
        }
        else{
               myval = 200;
               MPI_Recv(&myval, 1, MPI_INT, 0, 0, MPI_COMM_WORLD, MPI_STATUS_IGNORE);
               printf("\nmyid: %d \t Data received.\n", myid);
               printf("\nmyid: %d \t myval = %d\n", myid, myval);
        }
	}

	MPI_Finalize();
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc p2p_mpi7.c -o p2p_mpi7.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./p2p_mpi7.out 4
#+end_src

#+RESULTS:
: Submitted batch job 1166400


** Sending array to process 1
#+begin_src C :tangle p2p_mpi_array9.c
#include"stdio.h"
#include"mpi.h"
#define N 100

int main()
{
	int myid, size;
	int myval;

    int arr[N];
	//Initialize MPI environment
	MPI_Init(NULL,NULL);

	//Get total number of processes
	MPI_Comm_size(MPI_COMM_WORLD, &size);

	//Get my unique ID among all processes
	MPI_Comm_rank(MPI_COMM_WORLD, &myid);

	// Process with ID exactly equal to 0
	if(myid==0){
		//Initialize data to be sent
        for(int i = 0; i < N; i++) arr[i] = i + 1;
		//Send data
		MPI_Send(arr, N, MPI_INT, 1, 0, MPI_COMM_WORLD);
		printf("\nmyid: %d \t Data sent.\n", myid);
	}
	else if(myid==1){	// Process with ID exactly equal to 1
		//Initialize receive array to some other data
		MPI_Recv(arr, N, MPI_INT, 0, 0, MPI_COMM_WORLD, MPI_STATUS_IGNORE);
		printf("\nmyid: %d \t Data received.\n", myid);
		//Print received data
        for(int i = 0; i < N; i++)
          printf("%d ", arr[i]);
	}

	//End MPI environment
	MPI_Finalize();
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc p2p_mpi_array9.c -o p2p_mpi_array9.out
#+end_src

#+RESULTS:


#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./p2p_mpi_array9.out 2
#+end_src

#+RESULTS:
: Submitted batch job 1165607
* Point to point communication
This will create 1000 send calls and 1000 recv calls which is not good for your network.
#+begin_src C :tangle p2p.c
#include<stdio.h>
#include<mpi.h>
#define N 100
int main(){
    int size, rank;
    int a[N];
    MPI_Init(NULL, NULL);
    MPI_Comm_size(MPI_COMM_WORLD, &size);
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    if(rank == 0){
        for(int i = 0; i < N; i++){
                a[i] = i + 1;
        }

        for(int i = 0; i < N; i++){
            MPI_Send(&a[i], 1, MPI_INT, 1, 0, MPI_COMM_WORLD);
        }
    }
    else{
        for(int i = 0; i < N; i++){
            MPI_Recv(&a[i], 1, MPI_INT, 0, 0, MPI_COMM_WORLD, MPI_STATUS_IGNORE);
        }
        for(int i = N - 10; i < N; i++){
            printf("%d ", a[i]);
        }
    }

    MPI_Finalize();
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc p2p.c -o p2p.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./p2p.out 2
#+end_src

#+RESULTS:
: Submitted batch job 1165610

** Better way
#+begin_src C :tangle p2p1.c
#include<stdio.h>
#include<mpi.h>
#define N 1000
int main(){
    int size, rank;
    int a[N];
    MPI_Init(NULL, NULL);
    MPI_Comm_size(MPI_COMM_WORLD, &size);
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    if(rank == 0){
        for(int i = 0; i < N; i++){
                a[i] = i + 1;
        }


        MPI_Send(a, N, MPI_INT, 1, 0, MPI_COMM_WORLD);
    }
    else{
        MPI_Recv(a, N, MPI_INT, 0, 0, MPI_COMM_WORLD, MPI_STATUS_IGNORE);
        for(int i = N - 10; i < N; i++){
            printf("%d ", a[i]);
        }
        printf("\n");
    }

    MPI_Finalize();
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc p2p1.c -o p2p1.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./p2p1.out 2
#+end_src

#+RESULTS:
: Submitted batch job 1166466

*** Compilation and Execution (Synchronous)
- Compile the program:
  #+BEGIN_src bash :session openmpi :exports both :results output
  mpicc mpi_sync.c -o mpi_sync.out
  #+END_SRC

  #+RESULTS:

- Run the program:
  #+BEGIN_src bash :session openmpi :exports both :results output
  sbatch script.sh ./mpi_sync.out 2
  #+END_SRC

  #+RESULTS:
  : Submitted batch job 1165613

*** Compilation and Execution (Asynchronous)
- Compile the program:
  #+BEGIN_src bash :session openmpi :exports both :results output
  mpicc mpi_async.c -o mpi_async.out
  #+END_SRC

  #+RESULTS:


- Run the program:
  #+BEGIN_src bash :session openmpi :exports both :results output
  sbatch script.sh ./mpi_async.out 2
  #+END_SRC

  #+RESULTS:
  : Submitted batch job 1165626

** Compilation and Execution
- Compile the program:
  #+BEGIN_src bash :session openmpi :exports both :results output
 mpicc mpi_array_sum.c -o mpi_array_sum.out
  #+END_SRC

  #+RESULTS:

- Run the program:
  #+BEGIN_src bash :session openmpi :exports both :results output
  sbatch script.sh ./mpi_array_sum.out 7
  #+END_SRC

  #+RESULTS:
  : Submitted batch job 1165629

* Array sum
#+begin_src C :tangle arrSum.c
#include <stdio.h>
#include <stdlib.h>
#include <mpi.h>

#define N 100

int main() {
    int rank, size;
    MPI_Init(NULL, NULL);
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);

    int chunksize = N / size;
    int* global_arr = NULL;
    int* local_arr = (int*)malloc(chunksize * sizeof(int));

    if (rank == 0) {
        global_arr = (int*)malloc(N * sizeof(int));
        for (int i = 0; i < N; i++) {
            global_arr[i] = i + 1;
        }
    }

    MPI_Scatter(global_arr, chunksize, MPI_INT, local_arr, chunksize, MPI_INT, 0, MPI_COMM_WORLD);

    int local_sum = 0;
    for (int i = 0; i < chunksize; i++) {
        local_sum += local_arr[i];
    }

    int* global_sums = NULL;
    if (rank == 0) {
        global_sums = (int*)malloc(size * sizeof(int));
    }

    MPI_Gather(&local_sum, 1, MPI_INT, global_sums, 1, MPI_INT, 0, MPI_COMM_WORLD);

    if (rank == 0) {
        int total_sum = 0;
        printf ("Array of local sums: \n");
        for (int i = 0; i < size; i++) {
            printf("%d ", global_sums[i]);
            total_sum += global_sums[i];
        }
        printf("\nTotal sum = %d\n", total_sum);
        free(global_arr);
        free(global_sums);
    }

    free(local_arr);
    MPI_Finalize();
    return 0;
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc arrSum.c -o arrSum.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./arrSum.out 10
#+end_src

#+RESULTS:
: Submitted batch job 1165632

* Array sum with Reduce
#+begin_src C :tangle arrSum_reduce.c
#include <stdio.h>
#include <stdlib.h>
#include <mpi.h>

#define N 100

int main() {
    int rank, size;
    MPI_Init(NULL, NULL);
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);
    int chunksize = N / size;
    int* global_arr = NULL;
    int* local_arr = (int*)malloc(chunksize * sizeof(int));
    if (rank == 0) {
        global_arr = (int*)malloc(N * sizeof(int));
        for (int i = 0; i < N; i++) {
            global_arr[i] = i + 1;
        }
    }
    MPI_Scatter(global_arr, chunksize, MPI_INT, local_arr, chunksize, MPI_INT, 0, MPI_COMM_WORLD);
    int local_sum = 0;
    for (int i = 0; i < chunksize; i++) {
        local_sum += local_arr[i];
    }
    int final_sum;
    MPI_Reduce(&local_sum, &final_sum, 1, MPI_INT, MPI_SUM, 0, MPI_COMM_WORLD);
    printf("rank = %d\ttotal sum = %d\n", rank, final_sum);
    if(rank == 0){
        free(global_arr);
    }
    free(local_arr);
    MPI_Finalize();
    return 0;
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc arrSum_reduce.c -o arrSum_reduce.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./arrSum_reduce.out 10
#+end_src

#+RESULTS:
: Submitted batch job 1165633

* Array sum with and broadcasting the total sum to all the process
#+begin_src C :tangle arrSum_reduce1.c
#include <stdio.h>
#include <stdlib.h>
#include <mpi.h>
#define N 10000

int main() {
    int rank, size;
    MPI_Init(NULL, NULL);
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);
    int chunksize = N / size;
    int* global_arr = NULL;
    int* local_arr = (int*)malloc(chunksize * sizeof(int));
    if (rank == 0) {
        global_arr = (int*)malloc(N * sizeof(int));
        for (int i = 0; i < N; i++) {
            global_arr[i] = i + 1;
        }
    }
    MPI_Scatter(global_arr, chunksize, MPI_INT, local_arr, chunksize, MPI_INT, 0, MPI_COMM_WORLD);
    int local_sum = 0;
    for (int i = 0; i < chunksize; i++) {
        local_sum += local_arr[i];
    }
    int final_sum;
    MPI_Reduce(&local_sum, &final_sum, 1, MPI_INT, MPI_SUM, 0, MPI_COMM_WORLD);
    MPI_Bcast(&final_sum, 1, MPI_INT, 0, MPI_COMM_WORLD);

    printf("rank = %d\ttotal sum = %d\n", rank, final_sum);
    if(rank == 0){
        free(global_arr);
    }
    free(local_arr);
    MPI_Finalize();
    return 0;
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc arrSum_reduce1.c -o arrSum_reduce1.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./arrSum_reduce1.out 10
#+end_src

#+RESULTS:
: Submitted batch job 1165635

* Array sum with all reduce
#+begin_src C :tangle arrSum_allreduce.c
#include <stdio.h>
#include <stdlib.h>
#include <mpi.h>
#define N 10000

int main() {
    int rank, size;
    MPI_Init(NULL, NULL);
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);
    int chunksize = N / size;
    int* global_arr = NULL;
    int* local_arr = (int*)malloc(chunksize * sizeof(int));
    if (rank == 0) {
        global_arr = (int*)malloc(N * sizeof(int));
        for (int i = 0; i < N; i++) {
            global_arr[i] = i + 1;
        }
    }
    MPI_Scatter(global_arr, chunksize, MPI_INT, local_arr, chunksize, MPI_INT, 0, MPI_COMM_WORLD);
    int local_sum = 0;
    for (int i = 0; i < chunksize; i++) {
        local_sum += local_arr[i];
    }
    int final_sum;
    MPI_Allreduce(&local_sum, &final_sum, 1, MPI_INT, MPI_SUM, MPI_COMM_WORLD);

    printf("rank = %d\ttotal sum = %d\n", rank, final_sum);
    if(rank == 0){
        free(global_arr);
    }
    free(local_arr);
    MPI_Finalize();
    return 0;
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc arrSum_allreduce.c -o arrSum_allreduce.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./arrSum_allreduce.out 10
#+end_src

#+RESULTS:
: Submitted batch job 1165638

* allgather
#+begin_src C :tangle task3.c
#include <stdio.h>
#include <stdlib.h>
#include <mpi.h>

#define N 100

int main() {
    int rank, size;
    MPI_Init(NULL, NULL);
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);

    int chunksize = N / size;
    int* global_arr;
    int* local_arr = (int*)malloc(chunksize * sizeof(int));

    if (rank == 0) {
        global_arr = (int*)malloc(N * sizeof(int));
        for (int i = 0; i < N; i++) {
            global_arr[i] = i + 1;
        }
    }

    MPI_Scatter(global_arr, chunksize, MPI_INT, local_arr, chunksize, MPI_INT, 0, MPI_COMM_WORLD);

    int local_sum = 0;
    for (int i = 0; i < chunksize; i++) {
        local_sum += local_arr[i];
    }

    int* global_sums = NULL;
    global_sums = (int*)malloc(size * sizeof(int));

    MPI_Allgather(&local_sum, 1, MPI_INT, global_sums, 1, MPI_INT, MPI_COMM_WORLD);

    for (int i = 0; i < size; i++) {
        printf("%d ", global_sums[i]);
    }
    printf("\n");
    if(rank == 0) free(global_arr);
    free(global_sums);

    free(local_arr);
    MPI_Finalize();
    return 0;
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc task3.c -o task3.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./task3.out 10
#+end_src

#+RESULTS:
: Submitted batch job 1165640

* Array sum with timing
#+begin_src C :tangle arrSum1.c
#include <stdio.h>
#include <stdlib.h>
#include <mpi.h>


int main() {
    int rank, size;
    MPI_Init(NULL, NULL);
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);

    const long long N = 1000000000;
    double startTime, endTime;
    long long chunksize = N / size;
    long long* global_arr = NULL;
    long long* local_arr = (long long*)malloc(chunksize * sizeof(long long));

    if (rank == 0) {
        global_arr = (long long*)malloc(N * sizeof(long long));
        for (int i = 0; i < N; i++) {
            global_arr[i] = i + 1;
        }
    }

    if(rank == 0) startTime = MPI_Wtime();
    MPI_Scatter(global_arr, chunksize, MPI_LONG_LONG_INT, local_arr, chunksize, MPI_LONG_LONG_INT, 0, MPI_COMM_WORLD);

    long long local_sum = 0;
    for (int i = 0; i < chunksize; i++) {
        local_sum += local_arr[i];
    }


    long long* global_sums = NULL;
    if (rank == 0) {
        global_sums = (long long*)malloc(size * sizeof(long long));
    }

    MPI_Gather(&local_sum, 1, MPI_LONG_LONG_INT, global_sums, 1, MPI_LONG_LONG_INT, 0, MPI_COMM_WORLD);

    if (rank == 0) {
        long long total_sum = 0;

        printf ("Array of local sums: \n");
        for (int i = 0; i < size; i++) {
            //printf("%d ", global_sums[i]);
            total_sum += global_sums[i];
        }
        endTime = MPI_Wtime();
        printf("rank %d : timing %lf\n", rank, endTime - startTime);
        printf("\nTotal sum = %lld\n", total_sum);
        free(global_arr);
        free(global_sums);
    }

    free(local_arr);
    MPI_Finalize();
    return 0;
}
#+end_src

#+begin_src bash :session openmpi :results output :exports both
mpicc arrSum1.c -o arrSum1.out
#+end_src

#+RESULTS:

#+begin_src bash :session openmpi :results output :exports both
sbatch script.sh ./arrSum1.out 100
#+end_src

#+RESULTS:
: Submitted batch job 1165772
